{
  "header": {
    "name": "Antonio Delage Cruzado",
    "experience": "Experiencia",
    "about": "Sobre mí",
    "projects": "Proyectos"
  },

  "mainDescription": {
    "subtitle": "FULL STACK DEVELOPER",
    "name": "Hola, soy Antonio Delage, contactame para crear",
    "title": "Tu aplicación web con las mejores tecnologías.",
    "sendMessage": "Enviar mensaje",
    "worksTechnology": "Aptitudes tecnicas: ",
    "modal": {
      "title": "Enviar mensaje",
      "subtitle": "Contacta conmigo",
      "linkedin": "A traves de Linkedin",
      "email": "A traves de Gmail"
    }
  },

  "experience": {
    "title": "Experiencia",
    "item1": {
      "position": "Full Stack Developer",
      "company": "Roiback, Mallorca - En remoto",
      "date": "sept.2024 - Actualidad",
      "description1": ""
    },
    "item2": {
      "position": "Full Stack Developer",
      "company": "Knowmad Mood, Jerez de la frontera - En remoto",
      "date": "sept.2023 - Actualidad",
      "description1": "-En mi proyecto con el cliente Roiback, me especializo en la transición de Django a React y en el back-end utilizo Python. En el front-end, empleo React con el patrón MVC, migrando de JavaScript a TypeScript para optimizar la calidad y legibilidad del código."
    },
    "item3": {
      "position": "Frontend Developer",
      "company": "Sectorea IT, Madrid - En remoto",
      "date": "marzo.2023 - sept.2023",
      "description1": "- Durante los primeros meses, tuve la oportunidad de practicar con proyectos reales del banco Santander, recibiendo formación en React por parte de mi empresa. Esta experiencia fue fundamental en mi desarrollo profesional y me permitió adquirir habilidades sólidas en el uso de React. ",
      "description2": "- Por otro lado, en el proyecto de desarrollo de aplicaciones web para el banco BBVA, utilicé litElement, JavaScript y CELLS para crear componentes de UI de alta calidad y escalables."
    },
    "item4": {
      "position": "React & Frontend Developer",
      "company": "The WhiteTeam, Madrid - En remoto",
      "date": "julio.2022 - marzo.2023",
      "description1": "- En el proyecto para el <b>Banco HSBC UK</b>, creé 2 páginas utilizando React. Mejoré la experiencia del usuario implementando React Query, Redux y React Router, lo que resultó en una interfaz más intuitiva.",
      "description2": "-Utilicé Sass y HTML para mejorar la apariencia y estética.",
      "description3": "- Se utilizó Jest y Cypress para realizar pruebas en la aplicación.",
      "description4": "-Seguí la metodología SCRUM y y utilicé Git para trabajar eficientemente y entregar resultados constantes.",
      "description5": "- En términos de rendimiento, la implementación de React Query resultó en un aumento del 40% en la velocidad de carga de datos y la implementación de Redux mejoró la consistencia de los datos en un 30%. La utilización de React Router también mejoró la navegación en un 20%. En general, estas mejoras contribuyeron a una experiencia de usuario más satisfactoria y un rendimiento general más alto."
    },
    "item5": {
      "position": "Frontend Developer",
      "company": "Digital Cuisine, Jerez de la frontera",
      "date": "junio.2021 - junio.2022",
      "description1": "- Primer proyecto con ReactJS donde desarrollé una aplicación con React basado en funciones, React Hooks y Leaflet.",
      "description2": "- Utilicé HTML , CSS para mejorar la apariencia y estética.",
      "description3": "- Seguí la metodología KANBAN con Azure y utilicé Git para trabajar eficientemente y entregar resultados constantes."
    },
    "item6": {
      "position": "Frontend Developer",
      "company": "Digital Cuisine, Jerez de la frontera",
      "date": "marzo.2021 - junio.2021",
      "description1": "- Estos meses tuve la oportunidad de trabajar en la resolución de tickets relacionados con la funcionalidad de la aplicación. Esto incluyó tareas tanto de desarrollo de nuevas funciones como de solución de errores.",
      "description2": "- Además de trabajar con VanillaJS, también utilizaba HTML y CSS para crear la interfaz de usuario y asegurar la consistencia visual en la aplicación. Por otro lado, utilizaba Git para llevar un control de versiones y colaborar con otros miembros del equipo en el desarrollo.",
      "description3": "- Esta experiencia me permitió mejorar mis habilidades en el desarrollo de aplicaciones con VanillaJS y cómo integrar diferentes tecnologías como HTML, CSS y Git para crear una aplicación completa y efectiva. Además, aprendí a trabajar en un equipo y resolver problemas de manera eficiente."
    }
  },

  "certificate": "Certificado en :",
  "contributeGitHub": "Puntualo en",

  "about": {
    "title": " Sobre mí",
    "item1": "- Profesional del desarrollo de aplicaciones web especializado en el frontend con la biblioteca React JS. Me considero una persona proactiva, implicada y con muchas ganas de aprender.",
    "item2": "- Actualmente estoy trabajando en el desarrollo de aplicaciones web con ReactJS y NodeJS. También estoy aprendiendo a utilizar la biblioteca NextJS para el desarrollo de aplicaciones web con SSR (Server Side Rendering).",
    "item3": "- Otra de las tecnologias que estoy deseando aprender son TypeScript,  GraphQL y MongoDB. También me gustaría aprender a utilizar la biblioteca React Native para el desarrollo de aplicaciones móviles."
  },

  "education": {
    "title": "Educación",
    "item1": {
      "title": "Grado Superior en Desarrollo de Aplicaciones Web",
      "center": "I.E.S Mar de Cadiz(Puerto de Santa Maria)",
      "date": "2018 - 2021"
    },
    "item2": {
      "title": "Estudios de eduación secundaria (Bachillerato)",
      "center": "Ntra Sña del Pilar (Jerez de la frontera)",
      "date": "2012 - 2015"
    }
  },

  "projects": {
    "title": "Proyectos",
    "item1": {
      "title": "Delin Open-AI",
      "subtitle": "Proyecto personal",
      "description": "Aplicación de chat inteligente utilizando React, UseLLM y Styled-Components, potenciada por autenticación segura de Clerk. La aplicación utiliza la API de OpenAI para generar respuestas a las preguntas del usuario.",
      "link": "https://delin-open-ai.vercel.app/"
    },
    "item2": {
      "title": "Luxestay Hotels",
      "subtitle": "Knowmad Mood",
      "description": "Prueba tecnica realizada en Knowmad mood. La prueba consistia en crear una pagina donde se viese el flujo de reservas de un hotel. En el proyecto se utilizan librerias como React, Redux Toolkit, styled-components, Formik.",
      "link": "https://luxestay-hotels.vercel.app/"
    },
    "item3": {
      "title": "Cookie Clicker Game",
      "subtitle": "Sectorea IT",
      "description": "Prueba tecnica realizada en Sectorea. La prueba consistia en hacer en 2 dias un minijuego de clicks, en el proyecto se utilizan tecnologias/librerias como React, Redux Toolkit, i18n, Vite, Husky, styled-components y Cypress.",
      "link": "https://cookie-clicker-adelage.vercel.app/"
    }
  },

  "footer": {
    "title": "Antonio Delage",
    "subtitle": "Página web de código abierto realizada con ReactJS.",
    "link": "Link al repositorio en GitHub",
    "contact": "Contáctame:",
    "follow": "Sigueme en:"
  }
}
