{
  "header": {
    "name": "Antonio Delage Cruzado",
    "experience": "Experience",
    "about": "About me",
    "projects": "Projects"
  },
  "mainDescription": {
    "subtitle": "FULL STACK DEVELOPER",
    "name": "Hello, I'm Antonio Delage, contact me to create",
    "title": "Your web application with best technologies.",
    "sendMessage": "Send Message",
    "worksTechnology": "Technical skills :",
    "modal": {
      "title": "Send Message",
      "subtitle": "Contact me",
      "linkedin": "Through Linkedin",
      "email": "Through Gmail"
    }
  },
  "experience": {
    "title": "Experience",
    "item1": {
      "position": "Full Stack Developer",
      "company": "Roiback - Remotely",
      "date": "sept.2024 - Present",
      "description1": ""
    },
    "item2": {
      "position": "Full Stack Developer",
      "company": "Knowmad Mood - Remotely",
      "date": "sept.2023 - Present",
      "description1": "- In my project with the Roiback client, I specialize in transitioning from Django to React and on the back-end I use Python. On the front-end, I use React with the MVC pattern, migrating from JavaScript to TypeScript to optimize the quality and readability of the code."
    },
    "item3": {
      "position": "Frontend Developer",
      "company": "Sectorea IT - Remotely",
      "date": "March.2023 - sept.2023",
      "description1": "- During the first months I had the opportunity to practice with real projects at Banco Santander, receiving training in React from my company. This experience was fundamental in my professional development and allowed me to acquire solid skills in its use from React.",
      "description2": "- On the other hand, in the web application development project for BBVA bank, I use litElement, JavaScript and CELLS to create high-quality and scalable UI components."
    },
    "item4": {
      "position": "React Developer",
      "company": "The WhiteTeam - Remotely",
      "date": "July.2022 - March.2023",
      "description1":"- In the project for <b>HSBC UK Bank</b>, I created 2 pages using React. I improved the user experience by implementing React Query, Redux and React Router, which resulted in a more intuitive interface.", 
      "description2":"- I used Sass and HTML to improve the look and feel",
      "description3":"-Jest and Cypress were used to test the application.",
      "description4": "- Followed SCRUM methodology and used Git to work efficiently and deliver consistent results.",
      "description5":"- In terms of performance, the implementation of React Query resulted in a 40% increase in data load speed and the implementation of Redux improved data consistency by 30%. The use of React Router also improved navigation by 20%. Overall, these improvements contributed to a more satisfying user experience and higher overall performance."
    },
    "item5": {
      "position": "Frontend Developer",
      "company": "Digital Cuisine ",
      "date": "June.2021 - June.2022",
      "description1": "- First project with ReactJS where I developed an application with function-based React, React Hooks and Leaflet.",
      "description2": "- I used HTML, CSS to improve the appearance and aesthetics.",
      "description3": "- I followed the KANBAN methodology with Azure and used Git to work efficiently and deliver consistent results."
    },
    "item6": {
      "position": "Frontend Developer",
      "company": "Digital Cuisine",
      "date": "March.2021 - June.2021",
      "description1": "- These months I had the opportunity to work on solving tickets related to the functionality of the application. This included both new feature development and bug fixing tasks.",
      "description2": "- In addition to working with VanillaJS, I also used HTML and CSS to create the user interface and ensure visual consistency in the application. On the other hand, I used Git to keep version control and collaborate with other team members on development.",
      "description3": "- This experience allowed me to improve my skills in developing applications with VanillaJS and how to integrate different technologies such as HTML, CSS and Git to create a complete and effective application. In addition, I learned how to work in a team and solve problems efficiently."
    }
  },
  "certificate": "Certified in :",
  "contributeGitHub": "Rate project",
  "about": {
    "title": "About me",
    "item1": "- Professional web application development specialized in the frontend with the React JS library. ",
    "item2": "- Currently I am working on the development of web applications with React JS and Node JS. ",
    "item3": "- Other technologies I'm looking forward to learn are TypeScript, GraphQL and MongoDB. I would also like to learn how to use the React Native library for mobile app development."
  },
  "education": {
    "title": "Education",
    "item1": {
      "title": "Higher Degree in Web Application Development",
      "center": "I.E.S Mar de Cadiz (Puerto de Santa Maria)",
      "date": "2018 - 2021"
    },
    "item2": {
      "title": "Secondary education studies (Bachillerato)",
      "center": "Ntra Sña del Pilar (Jerez de la Frontera)",
      "date": "2012 - 2015"
    }
  },
  "projects": {
    "title": "Projects",
    "item1": {
      "title": "Delin Open-AI",
      "subtitle": "Personal project",
      "description": "Smart chat app using React, UseLLM and Styled-Components, powered by secure authentication from Clerk. The app uses the OpenAI API to generate answers to user questions.",
      "link": "https://financialfitness.hsbc.co.uk/"
    },
    "item2": {
      "title": "Luxestay Hotels",
      "subtitle": "Knowmad Mood",
      "description": "Technical test carried out in Knowmad mood. The test consisted of creating a page where the flow of reservations for a hotel could be seen. Libraries such as React, Redux Toolkit, styled-components, Formik are used in the project.",
      "link": "https://sustainabilityassessment.business.hsbc.com/en-gb/"
    },
    "item3": {
      "title": "Cookie Clicker Game",
      "subtitle": "Sectorea IT",
      "description": "Technical test carried out in Sectorea. The test consisted of doing a click mini-game in 2 days. The project used technologies/libraries such as React, Redux Toolkit, i18n, Vite, Husky, styled-components and Cypress.",
      "link": "https://www.coronawarn.app/en/"
    }
  },
  "footer": {
    "title": "Antonio Delage",
    "subtitle": "Open source web page made with ReactJS.",
    "link": "Link to the repository on GitHub",
    "contact": "Contact me:",
    "follow": "Follow me in:"
  }
}
